/*
quickerSDLPoP, a barebones thread-safe version of SDLPop for routing
Copyright (C) 2021 Sergio Martin

based on

SDLPoP, a port/conversion of the DOS game Prince of Persia.
Copyright (C) 2013-2020  Dávid Nagy

This program is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program.  If not, see <https://www.gnu.org/licenses/>.

The authors of this program may be contacted at https://forum.princed.org
*/

#pragma once

namespace quicker
{

  #define __QS_BASE_FPS 60
  #define __QS_FEATHER_FALL_LENGTH 18.75
  #define __QS_MAX_CACHED_FILES 2048
  #define __QS_POP_MAX_PATH 1024
  #define __QS__COUNT(array) (sizeof(array) / sizeof(array[0]))
  #define __QS_NUM_GUARD_SKILLS 12

typedef struct rect_type
{
  int16_t top, left, bottom, right;
} rect_type;

typedef struct piece
{
  uint8_t base_id;
  uint8_t floor_left;
  int8_t base_y;
  uint8_t right_id;
  uint8_t floor_right;
  int8_t right_y;
  uint8_t stripe_id;
  uint8_t topright_id;
  uint8_t bottom_id;
  uint8_t fore_id;
  uint8_t fore_x;
  int8_t fore_y;
} piece;
typedef struct tile_and_mod
{
  uint8_t tiletype;
  uint8_t modifier;
} tile_and_mod;

typedef int   (*add_table_type)(int16_t chtab_id, int id, int8_t xh, int8_t xl, int ybottom, int blit, uint8_t peel);

typedef struct back_table_type
{
  int8_t xh;
  int8_t xl;
  int16_t y;
  uint8_t chtab_id;
  uint8_t id;
  int blit;
} back_table_type;

typedef struct midtable_type
{
  int8_t xh;
  int8_t xl;
  int16_t y;
  uint8_t chtab_id;
  uint8_t id;
  uint8_t peel;
  rect_type clip;
  int blit;
} midtable_type;

typedef struct wipetable_type
{
  int16_t left;
  int16_t bottom;
  int8_t height;
  int16_t width;
  int8_t color;
  int8_t layer;
} wipetable_type;

enum soundflags
{
  sfDigi = 1,
  sfMidi = 2,
  soundflags_4 = 4,
  sfLoop = 0x80
};

enum tiles
{
  tiles_0_empty = 0,
  tiles_1_floor = 1,
  tiles_2_spike = 2,
  tiles_3_pillar = 3,
  tiles_4_gate = 4,
  tiles_5_stuck = 5,
  tiles_6_closer = 6,             // a.k.a. drop button
  tiles_7_doortop_with_floor = 7, // a.k.a. tapestry
  tiles_8_bigpillar_bottom = 8,
  tiles_9_bigpillar_top = 9,
  tiles_10_potion = 10,
  tiles_11_loose = 11,
  tiles_12_doortop = 12, // a.k.a. tapestry top
  tiles_13_mirror = 13,
  tiles_14_debris = 14,          // a.k.a. broken floor
  tiles_15_opener = 15,          // a.k.a. raise button
  tiles_16_level_door_left = 16, // a.k.a. exit door
  tiles_17_level_door_right = 17,
  tiles_18_chomper = 18,
  tiles_19_torch = 19,
  tiles_20_wall = 20,
  tiles_21_skeleton = 21,
  tiles_22_sword = 22,
  tiles_23_balcony_left = 23,
  tiles_24_balcony_right = 24,
  tiles_25_lattice_pillar = 25,
  tiles_26_lattice_down = 26, // a.k.a. lattice support
  tiles_27_lattice_small = 27,
  tiles_28_lattice_left = 28,
  tiles_29_lattice_right = 29,
  tiles_30_torch_with_debris = 30
};

enum chtabs
{
  id_chtab_0_sword = 0,
  id_chtab_1_flameswordpotion = 1,
  id_chtab_2_kid = 2,
  id_chtab_3_princessinstory = 3,
  id_chtab_4_jaffarinstory_princessincutscenes = 4,
  id_chtab_5_guard = 5,
  id_chtab_6_environment = 6,
  id_chtab_7_environmentwall = 7,
  id_chtab_8_princessroom = 8,
  id_chtab_9_princessbed = 9
};

enum blitters
{
  blitters_0_no_transp = 0,
  // It seems to me that the "or" blitter can be safely replaced with the "transparent" blitter.
  blitters_2_or = 2,
  blitters_3_xor = 3, // used for the shadow
  blitters_white = 8,
  blitters_9_black = 9,
  blitters_10h_transp = 0x10,
  /* 0x40..0x4F will draw a monochrome image with color 0..15 */
  blitters_40h_mono = 0x40,
  blitters_46h_mono_6 = 0x46,  // used for palace wall patterns
  blitters_4Ch_mono_12 = 0x4C, // used for chomper blood
};

enum full_image_id
{
  TITLE_MAIN = 0,
  TITLE_PRESENTS,
  TITLE_GAME,
  TITLE_POP,
  TITLE_MECHNER,
  HOF_POP,
  STORY_FRAME,
  STORY_ABSENCE,
  STORY_MARRY,
  STORY_HAIL,
  STORY_CREDITS,
  MAX_FULL_IMAGES
};

enum grmodes
{
  gmCga = 1,
  gmHgaHerc = 2,
  gmEga = 3,
  gmTga = 4,
  gmMcgaVga = 5
};

enum sound_modes
{
  smAuto = 0,
  smAdlib = 1,
  smGblast = 2,
  smSblast = 3,
  smCovox = 4,
  smIbmg = 5,
  smTandy = 6
};

  #pragma pack(push, 1)
typedef struct link_type
{
  uint8_t left, right, up, down;
} link_type;

typedef struct level_type
{
  uint8_t fg[720];
  uint8_t bg[720];
  uint8_t doorlinks1[256];
  uint8_t doorlinks2[256];
  link_type roomlinks[24];
  uint8_t used_rooms;
  uint8_t roomxs[24];
  uint8_t roomys[24];
  uint8_t fill_1[15];
  uint8_t start_room;
  uint8_t start_pos;
  int8_t start_dir;
  uint8_t fill_2[4];
  uint8_t guards_tile[24];
  uint8_t guards_dir[24];
  uint8_t guards_x[24];
  uint8_t guards_seq_lo[24];
  uint8_t guards_skill[24];
  uint8_t guards_seq_hi[24];
  uint8_t guards_color[24];
  uint8_t fill_3[18];
} level_type;
static_assert(sizeof(level_type) == 2305);
  #pragma pack(pop)

typedef struct image_type
{
  int h;
  int w;
} image_type;

typedef struct peel_type
{
  rect_type rect;
} peel_type;

typedef struct chtab_type
{
  uint16_t n_images;
  uint16_t chtab_palette_bits;
  uint16_t has_palette_bits;
  // This is a variable-size array, with n_images elements.
  image_type * images[];
} chtab_type;

typedef struct full_image_type
{
  int id;
  chtab_type **chtab;
  enum blitters blitter;
  int xpos, ypos;
} full_image_type;

  #pragma pack(push, 1)
typedef struct rgb_type
{
  uint8_t r, g, b;
} rgb_type;
typedef struct dat_pal_type
{
  uint16_t row_bits;
  uint8_t n_colors;
  rgb_type vga[16];
  uint8_t cga[16];
  uint8_t ega[32];
} dat_pal_type;
typedef struct dat_shpl_type
{
  uint8_t n_images;
  dat_pal_type palette;
} dat_shpl_type;
static_assert(sizeof(dat_shpl_type) == 100);
  #pragma pack(pop)

typedef struct char_type
{
  uint8_t frame;
  uint8_t x;
  uint8_t y;
  int8_t direction;
  int8_t curr_col;
  int8_t curr_row;
  uint8_t action;
  int8_t fall_x;
  int8_t fall_y;
  uint8_t room;
  uint8_t repeat;
  uint8_t charid;
  uint8_t sword;
  int8_t alive;
  uint16_t curr_seq;
} char_type;

enum charids
{
  charid_0_kid = 0,
  charid_1_shadow = 1,
  charid_2_guard = 2,
  charid_3 = 3,
  charid_4_skeleton = 4,
  charid_5_princess = 5,
  charid_6_vizier = 6,
  charid_24_mouse = 0x18
};

enum sword_status
{
  sword_0_sheathed = 0,
  sword_2_drawn = 2
};

typedef struct auto_move_type
{
  int16_t time, move;
} auto_move_type;

/* obj_type:
  0 = Kid, princess, vizier
  1 = shadow
  2 = Guard
  3 = sword
  4 = mirror image
  5 = hurt splash
  0x80 = loose floor
*/
typedef struct objtable_type
{
  int8_t xh;
  int8_t xl;
  int16_t y;
  uint8_t chtab_id;
  uint8_t id;
  int8_t direction;
  uint8_t obj_type;
  rect_type clip;
  uint8_t tilepos;
} objtable_type;

typedef struct frame_type
{
  uint8_t image;

  // 0x3F: sword image
  // 0xC0: chtab
  uint8_t sword;

  int8_t dx;
  int8_t dy;

  // 0x1F: weight x
  // 0x20: thin
  // 0x40: needs floor
  // 0x80: even/odd pixel
  uint8_t flags;
} frame_type;

enum frame_flags
{
  FRAME_WEIGHT_X = 0x1F,
  FRAME_THIN = 0x20,
  FRAME_NEEDS_FLOOR = 0x40,
  FRAME_EVEN_ODD_PIXEL = 0x80,
};

typedef struct trob_type
{
  uint8_t tilepos;
  uint8_t room;
  int8_t type;
} trob_type;

typedef struct mob_type
{
  uint8_t xh;
  uint8_t y;
  uint8_t room;
  int8_t speed;
  uint8_t type;
  uint8_t row;
} mob_type;

enum directions
{
  dir_0_right = 0x00,
  dir_56_none = 0x56,
  dir_FF_left = -1
};

enum actions
{
  actions_0_stand = 0,
  actions_1_run_jump = 1,
  actions_2_hang_climb = 2,
  actions_3_in_midair = 3,
  actions_4_in_freefall = 4,
  actions_5_bumped = 5,
  actions_6_hang_straight = 6,
  actions_7_turn = 7,
  actions_99_hurt = 99,
};

typedef struct sword_table_type
{
  uint8_t id;
  int8_t x;
  int8_t y;
} sword_table_type;

  #pragma pack(push, 1)
typedef struct dat_header_type
{
  uint32_t table_offset;
  uint16_t table_size;
} dat_header_type;
static_assert(sizeof(dat_header_type) == 6);

typedef struct dat_res_type
{
  uint16_t id;
  uint32_t offset;
  uint16_t size;
} dat_res_type;
static_assert(sizeof(dat_res_type) == 8);

typedef struct dat_table_type
{
  uint16_t res_count;
  dat_res_type entries[];
} dat_table_type;
static_assert(sizeof(dat_table_type) == 2);

typedef struct image_data_type
{
  uint16_t height;
  uint16_t width;
  uint16_t flags;
  uint8_t data[];
} image_data_type;
static_assert(sizeof(image_data_type) == 6);
  #pragma pack(pop)

typedef struct dat_type
{
  struct dat_type *next_dat;
  FILE *handle;
  char filename[__QS_POP_MAX_PATH];
  dat_table_type *dat_table;
  // handle and dat_table are NULL if the DAT is a directory.
} dat_type;

typedef void   (*cutscene_ptr_type)();

typedef enum data_location
{
  data_none = 0,
  data_DAT = 1,
  data_directory = 2
} data_location;

enum sound_type
{
  sound_speaker = 0,
  sound_digi = 1,
  sound_midi = 2,
  sound_chunk = 3,
  sound_music = 4,
  sound_digi_converted = 6,
};
  #pragma pack(push, 1)
typedef struct note_type
{
  uint16_t frequency; // 0x00 or 0x01 = rest, 0x12 = end
  uint8_t length;
} note_type;
static_assert(sizeof(note_type) == 3);
typedef struct speaker_type
{ // IBM
  uint16_t tempo;
  note_type notes[];
} speaker_type;
static_assert(sizeof(speaker_type) == 2);

typedef struct digi_type
{ // wave in 1.0 and 1.1
  uint16_t sample_rate;
  uint16_t sample_count;
  uint16_t unknown;
  uint8_t sample_size; // =8
  uint8_t samples[];
} digi_type;
static_assert(sizeof(digi_type) == 7);

typedef struct digi_new_type
{ // wave in 1.3 and 1.4 (and PoP2)
  uint16_t sample_rate;
  uint8_t sample_size; // =8
  uint16_t sample_count;
  uint16_t unknown;
  uint16_t unknown2;
  uint8_t samples[];
} digi_new_type;
static_assert(sizeof(digi_new_type) == 9);

typedef struct midi_type
{
  char chunk_type[4];
  uint32_t chunk_length;
  union
  {
    struct
    {
      uint16_t format;
      uint16_t num_tracks;
      uint16_t delta;
      uint8_t tracks[0];
    } header;
    uint8_t data[0];
  };

} midi_type;

typedef struct converted_audio_type
{
  int length;
  int16_t samples[];
} converted_audio_type;

typedef struct sound_buffer_type
{
  uint8_t type;
  union
  {
    speaker_type speaker;
    digi_type digi;
    digi_new_type digi_new;
    midi_type midi;
    converted_audio_type converted;
  };
} sound_buffer_type;

typedef struct midi_raw_chunk_type
{
  char chunk_type[4];
  uint32_t chunk_length;
  union
  {
    struct
    {
      uint16_t format;
      uint16_t num_tracks;
      uint16_t time_division;
      uint8_t tracks[0];
    } header;
    uint8_t data[0];
  };

} midi_raw_chunk_type;

typedef struct midi_event_type
{
  uint32_t delta_time;
  uint8_t event_type;
  union
  {
    struct
    {
